In [91]:
import numpy as np
import pandas as pd

In [92]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [93]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [94]:
df['FlightNumber'][1]=10055
df['FlightNumber'][3]=10075

C:\Users\Jeggu\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Jeggu\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [95]:
df=df.astype({'FlightNumber': 'int64'})

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [96]:
data=df['From_To']


li=[]
for x in data :
    li.append(x.split('_'))

In [97]:
data=pd.DataFrame(data)
data

            From_To
0      LoNDon_paris
1      MAdrid_miLAN
2  londON_StockhOlm
3    Budapest_PaRis
4   Brussels_londOn

In [98]:
data.insert(1,'from',[x[0] for x in li])
data.insert(2,'to',[x[1] for x in li])
data=data.drop('From_To',axis=1)
df=pd.concat([data,df],axis=1)

In [99]:
df

,from,to,From_To,FlightNumber,RecentDelays,Airline
0,LoNDon,paris,LoNDon_paris,10045,"[23, 47]",KLM(!)
1,MAdrid,miLAN,MAdrid_miLAN,10055,[],<Air France> (12)
2,londON,StockhOlm,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,Budapest,PaRis,Budapest_PaRis,10075,[13],12. Air France
4,Brussels,londOn,Brussels_londOn,10085,"[67, 32]","""Swiss Air"""

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [100]:
for x in range(5):
    df['from'][x]=df['from'][x].capitalize()
    df['to'][x]=df['to'][x].capitalize()

C:\Users\Jeggu\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Jeggu\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [101]:
df

,from,to,From_To,FlightNumber,RecentDelays,Airline
0,London,Paris,LoNDon_paris,10045,"[23, 47]",KLM(!)
1,Madrid,Milan,MAdrid_miLAN,10055,[],<Air France> (12)
2,London,Stockholm,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,Budapest,Paris,Budapest_PaRis,10075,[13],12. Air France
4,Brussels,London,Brussels_londOn,10085,"[67, 32]","""Swiss Air"""

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [102]:
df=df.drop('From_To',axis =1)

In [103]:
df

       from         to  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [104]:
maximum=max([len(x) for x in df.RecentDelays])

In [105]:
for x in df.RecentDelays:
    if len(x)<maximum:
        for y in range(len(x),maximum):
            x.append(np.nan)

In [106]:
df2=pd.DataFrame({'recent_1':[x[0] for x in df.RecentDelays ],
                 'recent_2':[x[1] for x in df.RecentDelays] ,
                             'recent_3':[x[2] for x in df.RecentDelays] })

In [107]:
c=pd.concat([df,df2],axis=1)

In [108]:
c

,from,to,FlightNumber,RecentDelays,Airline,recent_1,recent_2,recent_3
0,London,Paris,10045,"[23, 47, nan]",KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,"[nan, nan, nan]",<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,"[13, nan, nan]",12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"[67, 32, nan]","""Swiss Air""",67.0,32.0,NaN